# -*- coding: utf-8 -*-
'''
Задание 5.1

Запросить у пользователя ввод IP-сети в формате: 10.1.1.0/24

Затем вывести информацию о сети и маске в таком формате:

Network:
10        1         1         0
00001010  00000001  00000001  00000000

Mask:
/24
255       255       255       0
11111111  11111111  11111111  00000000

Проверить работу скрипта на разных комбинациях сеть/маска.

Ограничение: Все задания надо выполнять используя только пройденные темы.
'''

netpool = input('Enter network pool: ')
netmask = int(input('Enter network mask: '))

net_template = '''
{:<8}  {:<8}  {:<8}  {:<8}
{:0<8b}  {:0<8b}  {:0<8b}  {:0<8b}
'''
msktuple = ('0.0.0.0', '128.0.0.0', '192.0.0.0', '224.0.0.0', '240.0.0.0', '248.0.0.0', '252.0.0.0', '254.0.0.0', '255.0.0.0', '255.128.0.0', '255.192.0.0', '255.224.0.0', '255.240.0.0', '255.248.0.0', '255.252.0.0', '255.254.0.0', '255.255.0.0', '255.255.128.0', '255.255.192.0', '255.255.224.0', '255.255.240.0', '255.255.248.0', '255.255.252.0', '255.255.254.0', '255.255.255.0', '255.255.255.128', '255.255.255.192', '255.255.255.224', '255.255.255.240', '255.255.255.248', '255.255.255.252', '255.255.255.254', '255.255.255.255')

host = netpool.split('.')
mask = msktuple[netmask].split('.')

print('\nNetwork:\n' + net_template.format(int(host[0]), int(host[1]), int(host[2]), int(host[3]), int(host[0]), int(host[1]), int(host[2]), int(host[3])))


print('Mask:\n/' + str(netmask) + net_template.format(int(mask[0]), int(mask[1]), int(mask[2]), int(mask[3]), int(mask[0]), int(mask[1]), int(mask[2]), int(mask[3])))
