# -*- coding: utf-8 -*-
'''
Задание 5.1a

Всё, как в задании 5.1. Но, если пользователь ввел адрес хоста, а не адрес сети,
то надо адрес хоста преобразовать в адрес сети и вывести адрес сети и маску, как в задании 5.1.

Пример адреса сети (все биты хостовой части равны нулю):
* 10.0.1.0/24
* 190.1.0.0/16

Пример адреса хоста:
* 10.0.1.1/24 - хост из сети 10.0.1.0/24
* 10.0.5.1/30 - хост из сети 10.0.5.0/30

Если пользователь ввел адрес 10.0.1.1/24,
вывод должен быть таким:

Network:
10        0         1         0
00001010  00000000  00000001  00000000

Mask:
/24
255       255       255       0
11111111  11111111  11111111  00000000

Проверить работу скрипта на разных комбинациях сеть/маска.

Ограничение: Все задания надо выполнять используя только пройденные темы.

'''

netpool = input('Enter network pool: ')
netmask = int(input('Enter network mask: '))

net_template = '''
{:<8}  {:<8}  {:<8}  {:<8}
{:0<8b}  {:0<8b}  {:0<8b}  {:0<8b}
'''
msktuple = ('0.0.0.0', '128.0.0.0', '192.0.0.0', '224.0.0.0', '240.0.0.0', '248.0.0.0', '252.0.0.0', '254.0.0.0', '255.0.0.0', '255.128.0.0', '255.192.0.0', '255.224.0.0', '255.240.0.0', '255.248.0.0', '255.252.0.0', '255.254.0.0', '255.255.0.0', '255.255.128.0', '255.255.192.0', '255.255.224.0', '255.255.240.0', '255.255.248.0', '255.255.252.0', '255.255.254.0', '255.255.255.0', '255.255.255.128', '255.255.255.192', '255.255.255.224', '255.255.255.240', '255.255.255.248', '255.255.255.252', '255.255.255.254', '255.255.255.255')

host = netpool.split('.')
mask = msktuple[netmask].split('.')

ip0, ip1, ip2, ip3 = host[0], host[1], host[2], host[3]

msk0, msk1, msk2, msk3 = mask[0], mask[1], mask[2], mask[3]

pool0, pool1, pool2, pool3 = (int(host[0])&int(mask[0])), (int(host[1])&int(mask[1])), (int(host[2])&int(mask[2])), (int(host[3])&int(mask[3]))

pool = str(pool0) + '.' + str(pool1) + '.' + str(pool2) + '.' + str(pool3)

print('\nNetwork:\n' + net_template.format(pool0, pool1, pool2, pool3, pool0, pool1, pool2, pool3))

print('Mask:\n/' + str(netmask) + net_template.format(int(mask[0]), int(mask[1]), int(mask[2]), int(mask[3]), int(mask[0]), int(mask[1]), int(mask[2]), int(mask[3])))
